#Варіант 8
# 1.  Користувач  задає  два  рядки  символів.  Програма  повинна  вивести  на екран усі символи, які є у першому рядку і яких немає у другому рядку.
# 2.  Користувач  вводить  цілі  числа,  розділені  пробілами,  в  одному  рядку. Програма повинна дописати перед кожним числом вираз «х=» і вивести рядок на екран.
#1
s1 = input('Перший рядок  ')
s2 = input('Другий рядок  ')
sp = list(s1)
for i in s1:
    if not i in s2:
        sp.append(i)
print(sp)
#2
S = input('add  ')
for i in S:
    if i.isdigit():
        S1 = S.replace(i, 'x='+i)


